INSERT INTO Authors /*(name)*/ VALUES 
	(1, 'Лев Толстой'),
	(2, 'Стивен Кинг'),
	(3, 'Николай Чернышевский'),
	(4, 'Дарья Донцова'),
	(5, 'Александр Блок'),
	(6, 'Касюн Таками'),
	(7, 'Анна Орлова'),
	(8, 'Юрий Венигоров'),
	(9, 'Светлана Егорова');


INSERT INTO Books /*(gеnre, title, publishing_house, publication_year, page_count, count_book, cover, price)*/ VALUES 
	(1, 'классика', 'Война и мир', 'Просвещение', 2012, 1560, 12, 'Твёрдая', 1700),
	(2, 'ужасы', 'Оно', 'АСТ', 2015, 1242, 5, 'Мягкая', 950),
	(3, 'классика', 'Что делать?', 'Азбука', 2012, 426, 1, 'Твёрдая', 400),
	(4, 'фантастика', 'Наука и проклятия', 'Миф', 2019, 456, 2, 'Твёрдая тканевая', 560),
	(5, 'детектив', 'Вынос дела', 'Эксмо', 2016, 245, 10, 'Кожаная', 360),
	(6, 'триллер', 'Королевская битва', 'Амфора', 2016, 629, 7, 'Твёрдая', 730),
	(7, 'поэзия', 'Лирика', 'Стрекоза', 2018, 288, 8, 'Твёрдая тканевая', 270),
	(8, 'научная литература', 'Элементы математики в физике', 'Просвещение', 2015, 345, 15, 'Твёрдая', 630);

INSERT INTO Books_authors VALUES 
	(1, 1),
	(2, 2),
	(3, 3),
	(4, 7),
	(5, 4),
	(6, 6),
	(7, 5),
	(8, 8),
	(8, 9);

INSERT INTO Users /*(surname, first_name, patronymic, address, phone_number, e_mail, password_hash, user_right)*/ VALUES 
	(1, 'Матвеев', 'Даниил', 'Олегович', 'г.Москва, Лермонтовский проспект, д.13, к.56', '89507899067', 'matbeeb_d.mail.ru', 'drgdrh', 'администратор'),
	(2, 'Митин', 'Виктор', 'Владимирович', 'г.Москва, Ломоносовский проспект, д.27, к.11', '89779347105', 'mitin_v.mail.ru', 'dgdrgaetes','клиент'),
	(3, 'Кометова', 'Дарья', 'Максимовна', 'г.Москва, ул.Ленина, д.4, к.128', 89507895634,'kometova_d.mail.ru', 'drgyhruw','клиент'),
	(4, 'Денин', 'Борис', 'Ильич', 'г.Москва, ул.Вавилова, д.103, к.26', '89003456704', 'denin_b.mail.ru', 'sgtrs','клиент'),
	(5, 'Огородникова', 'Анастасия', 'Станиславовна', 'г.Москва, ул.Гагарина, д.56, к.17', '89022345676', 'ogorodnikova_a.mail.ru', 'dsrgedsha', 'клиент'),
	(6, 'Межукова', 'Валерия', 'Игоревна', 'г.Москва, Мичуринский проспект, д.103, к.1', '89087887005', 'mezhukova_v.mail.ru', 'esgrshfc', 'клиент'),
	(7, 'Костина', 'Екатерина', 'Андреевна', 'г.Москва, ул.Новый Арбат, д.48, к.56', '89082405686', 'kostina_e.mail.ru', 'ergesdh', 'клиент');

INSERT INTO Orders /*(id_customer, delivery_address, payment_method, order_date, delivery_date, status, delivery_price)*/ VALUES 
	(1, 2, 'г.Москва, Ломоносовский проспект, д.27, к.11', 'картой', '23/01/2020 10:30:06', '26/01/2020', 'доставлен', 0),
	(2, 2, 'г.Москва, ул.Вавилова, д.43, к.107 ', 'картой', '18/02/2020 11:30:06', '27/02/2020', 'в обработке', 0),
	(3, 1, 'г.Москва, Лермонтовский проспект, д.13, к.56', 'картой', '19/12/2020 12:30:06', '26/02/2020', 'собран', 0),
	(4, 6, 'г.Москва, Мичуринский проспект, д.103, к.1',  'наличными', '20/02/2020 13:30:06', '27/02/2020', 'в пути', 0),
	(5, 3, 'г.Москва, ул.Ленина, д.4, к.128', 'наличными', '29/01/2020 14:30:06', '01/02/2020', 'доставлен', 0),
	(6, 5, 'г.Тула, ул.Гагарина, д.56, к.17', 'наличными', '19/02/2020 15:30:06', '27/02/2020', 'в обработке', 100),
	(7, 4, 'г.Москва, ул.Вавилова, д.103, к.26', 'картой', '30/01/2020 16:30:06', '05/02/2020', 'доставлен', 0);

INSERT INTO Order_basket VALUES 
	(1, 2, 950, 3),
	(1, 3, 400, 1),
	(3, 1, 1600, 1),
	(4, 5, 360, 2),
	(5, 7, 270, 1),
	(2, 5, 360, 1),
	(6, 7, 250, 2),
	(3, 2, 950, 1),
	(7, 4, 560, 1);

INSERT INTO Basket_customer VALUES 
	(1, 3, 2),
	(2, 3, 1),
	(2, 1, 1);


